# for i in range (0, 14, 2):
#     print(i)


# l = [3, 7, 5, 4, 1, True, 4.2, "good"]
# for i in range(len(l)):
#     print(l[i])

# l = [3, 7, 5, 4, 1, True, 4.2, "good"]
# for i in enumerate(l):
#     print(i)

# l = [3, 7, 5, 4, 1, True, 4.2, "good"]
# for ind, arbuz in enumerate(l):
#     print(f"Индекс:, {ind}, значение {arbuz}")

# for i in range (1,11):
#     if i == 4:
#         continue  # пропуск итерации
#     elif i == 5:
#         break
#     print("Прыжок №",i)

# списки
# (мутабельный-изменяемый, немутабельный- не изменяемый)
# l = []
# l.append("булка1")
# l.append("булка2")
# l.append("булка3")
#
# #-------------------------------------------
# x = l.remove("булка2") # удалить по значению
# print(x)  # .remove() ничего не возвращает
# #-------------------------------------------
#
# #-------------------------------------------
# u = l.pop(0) # удалить по индексу
# print(u) # возвращает значение удаленого элемента
# #-------------------------------------------
#
# print(l)

# l = ["a" ,"b" ,"c"]
# print(l.index("c"))
# l.insert(1,"d")
# print(l)

# Кортеж (мутабельный-изменяемый, немутабельный- не изменяемый)

t = (1, 2, 3, 4)  # tupple, котреж, ---> не изменяемый
empty_t = ()
one_t = ("racks",)
print(one_t)
